Revit 2027 API
ParameterTypeId.SteelElemPlateShortenCutstraight Property
 "Cut straight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemPlateShortenCutstraight { get; }
Public Shared ReadOnly Property SteelElemPlateShortenCutstraight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemPlateShortenCutstraight {
	ForgeTypeId^ get ();
}
static member SteelElemPlateShortenCutstraight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace